In [1]:
# Creating DataFrame
import pandas as pd
r1={
    'sub_id':['1','2','3','4'],
    'first':['class','bhora','debo','pinyu'],
    'second':['mishra','dad','bad','tat']
}
df1=pd.DataFrame(r1)
df1

  sub_id  first  second
0      1  class  mishra
1      2  bhora     dad
2      3   debo     bad
3      4  pinyu     tat

# CREATING NEW COLUMN IN EXISITING DATAFRAME

In [3]:
a1=['vik','son','dad','pop']

In [6]:
df1['Third']=a1

In [7]:
df1

  sub_id  first  second Third
0      1  class  mishra   vik
1      2  bhora     dad   son
2      3   debo     bad   dad
3      4  pinyu     tat   pop

In [18]:
new=df1['first'].values    # values will print the column in numpy array format
new

array(['class', 'bhora', 'debo', 'pinyu'], dtype=object)

In [20]:
# Now new is numpy array and we can acess it value the way we don in nump array
new[0:2]

array(['class', 'bhora'], dtype=object)

In [11]:
print(type(df1['first'].values))

<class 'numpy.ndarray'>

In [13]:
df1['first']   # and this will print in pandas series format

0    class
1    bhora
2     debo
3    pinyu
Name: first, dtype: object

In [14]:
print(type(df1['first']))

<class 'pandas.core.series.Series'>

In [22]:
a=df1['first']  #  ye ek bracket se series ban jata hai
a

0    class
1    bhora
2     debo
3    pinyu
Name: first, dtype: object

In [23]:
a2=df1[['first']]   # do bracket dalne se datafrane ban jata hai

In [25]:
print(type(a2))

<class 'pandas.core.frame.DataFrame'>

In [26]:
a2.values   #  isse dataframe ke element array mai aa jate hai

array([['class'],
       ['bhora'],
       ['debo'],
       ['pinyu']], dtype=object)

In [28]:
d1=list(a2)
print(type(d1))

<class 'list'>